; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-1-192)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	s0 - location
	s1 - location
	s2 - location
	p1-0 - location
	p1-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 12)
	(= (time-to-walk p1-0 s1) 12)
	(= (time-to-walk s0 p1-0) 21)
	(= (time-to-walk p1-0 s0) 21)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 14)
	(= (time-to-walk p1-2 s1) 14)
	(= (time-to-walk s2 p1-2) 20)
	(= (time-to-walk p1-2 s2) 20)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 27)
	(= (time-to-drive s1 s2) 27)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 4)
	(= (time-to-drive s1 s0) 4)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 2)
	(= (time-to-drive s2 s0) 2)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s1)
	(at truck2 s2)
	(at truck4 s2)
	(at package1 s0)
	))

(:metric minimize (+ (* 1 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 4
2. (drive-truck truck2 s1 s2 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 0 to 270
   goals met: 2 of 4
3. (load-truck package1 truck2 s2)
   deleted: (at package1 s2)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 4
4. (drive-truck truck2 s2 s0 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 270 to 292
   goals met: 1 of 4
5. (disembark-truck driver1 truck2 s0)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 1 of 4
6. (board-truck driver1 truck4 s0)
   deleted: (at driver1 s0) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 1 of 4
7. (drive-truck truck4 s0 s2 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (fuel-used) from 292 to 312
   goals met: 2 of 4
8. (walk driver2 s1 p1-0)
   deleted: (at driver2 s1)
   added: (at driver2 p1-0)
   goals met: 1 of 4
9. (unload-truck package1 truck2 s0)
   deleted: (in package1 truck2)
   added: (at package1 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 2 of 4
10. (walk driver2 p1-0 s0)
   deleted: (at driver2 p1-0)
   added: (at driver2 s0)
   goals met: 2 of 4
11. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 4
12. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 312 to 352
   goals met: 2 of 4
13. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 3 of 4
14. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 3 of 4
15. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (fuel-used) from 352 to 622
   goals met: 4 of 4
